/**********************************************
文件名：		user_midi_subr.c
功能描述：	
**********************************************/

#include 	"ht32.h"
#include 	"define_type.h"
#include 	"define.h"
#include	"user.h"
#include 	"midi_decode.h"
#include	"key_func.h"

//=============================================
//函数名：	__L_User_Before_Note_Play
//功能描述：
//
//MIDI 格式 音符发音前调用 可改变音色 音高 音量及是否发声
/*可修改	u16		R_Note_Tone;
					u8		R_Note_Value;
					u8		R_Note_Volume;
					MIDI.F_midi_note_mute=c_u8_true;	
*/
//=============================================
void	__L_User_Before_Note_Play(void)
{
	
		
}


//=============================================
//函数名：	__L_User_Measure_Finish
//功能描述：	开启圆点S13.
//=============================================
void	__L_User_Measure_Finish(void)
{
														
}
//=============================================
//函数名：	__L_User_Beat_Finish
//功能描述：	随着节拍按照顺序开启圆点D3，D4，D5.
//=============================================
void	__L_User_Beat_Finish(void)
{
											
}
//=============================================
//函数名：	__L_User_Half_Beat_Finish
//功能描述：	
//=============================================
void	__L_User_Half_Beat_Finish(void)
{
	
}
//#############################################

//=============================================
//函数名：	__L_User_1_48Beat
//功能描述： 间隔 1/48beat计数
//=============================================
void	__L_User_1_48Beat(u8	r_beat)
{

	

}







//=============================================
//函数名：	__L_User_2ms_Count
//功能描述：间隔 2ms 时间的计数.
//=============================================
void	__L_User_2ms_Count(u16 r_2ms)
{
	if(R_Func_Key_Dbnc<=c_time_dbnc_max)
		R_Func_Key_Dbnc+=r_2ms;
	
	if(R_Time_Mute)
	{
		if(R_Time_Mute<r_2ms)
			R_Time_Mute=0;
		else
			R_Time_Mute-=r_2ms;
	}
	
}

//=============================================
//函数名:	__L_User_Rhy_Main_Start
//功能描述:	主节奏起始点
//=============================================
void	__L_User_Rhy_Main_Start(void)
{
	
}

//=============================================
//函数名： 	__L_User_Rhy_Replay
//功能描述：
//=============================================
void	__L_User_Rhy_Replay()
{

}

//=============================================
//函数名：	__L_User_Midi_End
//功能描述：
//=============================================
void	__L_User_Midi_End()
{

}

void	__L_Midi_In_All_Sound_Off()
{

}




